// JavaScript Document
if (Number(data.clientid) == 7879826) {data.f_nclient = 'A101';}
if (Number(data.clientid) == 22670212) {data.f_nclient = 'A101';}
if (Number(data.clientid) == 20042978) {data.f_nclient = 'A101';}
if (Number(data.clientid) == 22636404) {data.f_nclient = 'A101';}
if (Number(data.clientid) == 1001704844) {data.f_nclient = 'A101';}
var bad_code_f = ['D007','D009','D010','D040','D080','D087','D089','D092','D093','D202','D213','D217','D219','D224','D225','D226','D257','D258','D259','D263','D264','D266','D268','D271','D272',
    'D273','D275','D276','D279','D280','D281','D286','D290','D296','D297','D299'];
comment_f = "";
comment_j = "";

switch(data.f_nclient) {
    case ('D001'):  comment_f = 'Погасіть прострочену заборгованість у ПриватБанку'; break;
    case ('D003'):  comment_f = 'Погасіть прострочену заборгованість у ПриватБанку'; break;
    case ('D004'):  comment_f = 'Шановний клієнте, нажаль, ця послуга Вам недоступна! Вам необхідно поліпшити свою кредитну історію в Банку'; break;
    case ('D006'):  comment_f = 'Послуга доступна клієнтам у віці від 21 року'; break;
    case ('D008'):  comment_f = 'Вам необхідно переоформити картку. Ви можете звернуться в будь-яке відділення ПриватБанку!'; break;
    case ('D013'):  comment_f = 'Надайте в Банк довідку про вид на проживання або дозвіл на проживання, та повторіть спробу!'; break;
    case ('D015'):  comment_f = 'Вам або Вашому гаранту необхiдно збiльшити обсяг надходжень на поточний рахунок. Спробуйте подать іншу заявку через 30 днів!'; break;
    case ('D033'):  comment_f = 'Вам необхідно оформіть нову картку в будь-якому відділенні ПриватБанку!'; break;
    case ('D035'):  comment_f = 'Вам необхідно погасити прострочену заборгованість за кредитами поруки!'; break;
    case ('D038'):  comment_f = 'Повторіть спробу після погашення реструктуризованого кредита!'; break;
    case ('D060'):  comment_f = 'Вам необхідно погасити прострочену заборгованість за кредитами близьких родичів!'; break;
    case ('D090'):  comment_f = 'Вам необхідно мати наявність позитивної кредитної історії - корестуйтесь кредитной карткой та не допускайте прострочень не менше 6 місяцiв!'; break;
    case ('D098'):  comment_f = 'Вам необхідно поліпшити свою кредитну історію в Банку'; break;
    case ('D204'):  comment_f = 'Погасіть поточні податкові зобов\'язання та повторіть спробу!'; break;
    case ('D205'):  comment_f = 'Ви маєте прострочену заборгованість. Погасіть iї та повторіть спробу!'; break;
    case ('D215'):  comment_f = 'Вам необхідно погасити прострочену заборгованість за кредитами близьких родичів!'; break;
    case ('D220'):  comment_f = 'Погасіть активні кредити та повторіть спробу через 10 днів!'; break;
    case ('D221'):  comment_f = 'На поточний момент Вам відмовлено. Продовжуйте своєчасно погашати свою кредитну картку та спробуйте ще раз'; break;
    case ('D274'):  comment_f = 'Вам необхідно оновити паспортнi даннi в будь-якому відділеннi ПриватБанку та повторіть спробу!'; break;
    case ('D277'):  comment_f = 'Вам необхідно пройти повторну ідентифікацію. Ви можете звернуться в будь-яке відділення ПриватБанку!'; break;
    case ('D298'):  comment_f = 'Вам необхідно поліпшити свою кредитну історію в Банку'; break;
    case ('D302'):  comment_f = 'Ця послуга Вам недоступна, так як на картку встановлено обмеження на зняття готівки'; break;
    case ('D500'):  comment_f = 'Ця послуга Вам недоступна'; break;
}

switch(data.j_nclient) {
    case ('D011'):  comment_j = 'Вам необхідно вказати інше підприємство, в якому Ви власник, та яке буде Вашим гарантом!'; break;
    case ('D009'):  comment_j = 'Ваш гарант вже виступив гарантом по іншій заявці, яка узгоджена. Вам необхідно вказати інше підприємство, яке буде Вашим гарантом'; break;
    case ('D005'):  comment_j = 'Вам необхідно вказати інше підприємство, яке буде Вашим гарантом'; break;
    case ('D017'):  comment_j = 'Основна дiяльнiсть вказаного потенцiйного поручителя не дозволяє буди Вашим гарантом. Вам необхідно вказати інше підприємство'; break;
}



if (data.j_nclient != 'A101' || data.f_nclient != 'A101') {
    if (bad_code_f.indexOf(data.f_nclient) != -1 ) {
        data.FinalCode = 'D001'+'_'+data.f_nclient;
        data.Decision = 'Decline';
        data.comment = 'Шановний клієнте, ця послуга Вам недоступна';
    }
    else {
        if (data.j_nclient != 'A101') {
            if (data.f_nclient != 'A101') {
                data.FinalCode = data.j_nclient+'_'+data.f_nclient;
                data.Decision = 'Decline';
                data.comment = 'Шановний клієнте! '+ comment_f +';'+comment_j;
            }
            else {
                data.FinalCode = data.j_nclient;
                data.Decision = 'Decline';
                data.comment = 'Шановний клієнте! '+comment_j;
            }
        }
        else {
            data.FinalCode = 'D001'+'_'+data.f_nclient;
            data.Decision = 'Decline';
            data.comment = 'Шановний клієнте! '+comment_f;
        }
    }
}